docs/qa/local-load-soak-test/raw/k6-verify-relogin-20260608-085938.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/mixed-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 4 max VUs, 2m30s max duration (incl. graceful stop):
              * mixed: 4 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 4/4 VUs, 0 complete and 0 interrupted iterations
mixed   [   1% ] 4 VUs  0m00.8s/2m0s

running (0m02.0s), 4/4 VUs, 0 complete and 0 interrupted iterations
mixed   [   1% ] 4 VUs  0m01.8s/2m0s

running (0m03.0s), 4/4 VUs, 0 complete and 0 interrupted iterations
mixed   [   2% ] 4 VUs  0m02.8s/2m0s

running (0m04.0s), 4/4 VUs, 3 complete and 0 interrupted iterations
mixed   [   3% ] 4 VUs  0m03.8s/2m0s

running (0m05.0s), 4/4 VUs, 4 complete and 0 interrupted iterations
mixed   [   4% ] 4 VUs  0m04.8s/2m0s

running (0m06.0s), 4/4 VUs, 4 complete and 0 interrupted iterations
mixed   [   5% ] 4 VUs  0m05.8s/2m0s

running (0m07.0s), 4/4 VUs, 6 complete and 0 interrupted iterations
mixed   [   6% ] 4 VUs  0m06.8s/2m0s

running (0m08.0s), 4/4 VUs, 8 complete and 0 interrupted iterations
mixed   [   6% ] 4 VUs  0m07.8s/2m0s

running (0m09.0s), 4/4 VUs, 8 complete and 0 interrupted iterations
mixed   [   7% ] 4 VUs  0m08.8s/2m0s

running (0m10.0s), 4/4 VUs, 9 complete and 0 interrupted iterations
mixed   [   8% ] 4 VUs  0m09.8s/2m0s

running (0m11.0s), 4/4 VUs, 10 complete and 0 interrupted iterations
mixed   [   9% ] 4 VUs  0m10.8s/2m0s

running (0m12.0s), 4/4 VUs, 11 complete and 0 interrupted iterations
mixed   [  10% ] 4 VUs  0m11.8s/2m0s

running (0m13.0s), 4/4 VUs, 13 complete and 0 interrupted iterations
mixed   [  11% ] 4 VUs  0m12.8s/2m0s

running (0m14.0s), 4/4 VUs, 14 complete and 0 interrupted iterations
mixed   [  11% ] 4 VUs  0m13.8s/2m0s

running (0m15.0s), 4/4 VUs, 16 complete and 0 interrupted iterations
mixed   [  12% ] 4 VUs  0m14.8s/2m0s

running (0m16.0s), 4/4 VUs, 17 complete and 0 interrupted iterations
mixed   [  13% ] 4 VUs  0m15.8s/2m0s

running (0m17.0s), 4/4 VUs, 19 complete and 0 interrupted iterations
mixed   [  14% ] 4 VUs  0m16.8s/2m0s

running (0m18.0s), 4/4 VUs, 20 complete and 0 interrupted iterations
mixed   [  15% ] 4 VUs  0m17.8s/2m0s

running (0m19.0s), 4/4 VUs, 20 complete and 0 interrupted iterations
mixed   [  16% ] 4 VUs  0m18.8s/2m0s

running (0m20.0s), 4/4 VUs, 23 complete and 0 interrupted iterations
mixed   [  16% ] 4 VUs  0m19.8s/2m0s

running (0m20.1s), 4/4 VUs, 25 complete and 0 interrupted iterations
mixed   [  17% ] 4 VUs  0m20.8s/2m0s

running (0m21.1s), 4/4 VUs, 26 complete and 0 interrupted iterations
mixed   [  18% ] 4 VUs  0m21.8s/2m0s

running (0m22.1s), 4/4 VUs, 26 complete and 0 interrupted iterations
mixed   [  19% ] 4 VUs  0m22.8s/2m0s

running (0m23.1s), 4/4 VUs, 28 complete and 0 interrupted iterations
mixed   [  20% ] 4 VUs  0m23.8s/2m0s

running (0m24.1s), 4/4 VUs, 29 complete and 0 interrupted iterations
mixed   [  21% ] 4 VUs  0m24.8s/2m0s

running (0m25.1s), 4/4 VUs, 31 complete and 0 interrupted iterations
mixed   [  21% ] 4 VUs  0m25.8s/2m0s

running (0m26.1s), 4/4 VUs, 32 complete and 0 interrupted iterations
mixed   [  22% ] 4 VUs  0m26.8s/2m0s

running (0m27.1s), 4/4 VUs, 33 complete and 0 interrupted iterations
mixed   [  23% ] 4 VUs  0m27.8s/2m0s

running (0m28.1s), 4/4 VUs, 37 complete and 0 interrupted iterations
mixed   [  24% ] 4 VUs  0m28.8s/2m0s

running (0m29.1s), 4/4 VUs, 38 complete and 0 interrupted iterations
mixed   [  25% ] 4 VUs  0m29.8s/2m0s

running (0m30.1s), 4/4 VUs, 41 complete and 0 interrupted iterations
mixed   [  26% ] 4 VUs  0m30.8s/2m0s

running (0m31.1s), 4/4 VUs, 41 complete and 0 interrupted iterations
mixed   [  26% ] 4 VUs  0m31.8s/2m0s

running (0m32.1s), 4/4 VUs, 41 complete and 0 interrupted iterations
mixed   [  27% ] 4 VUs  0m32.8s/2m0s

running (0m33.1s), 4/4 VUs, 43 complete and 0 interrupted iterations
mixed   [  28% ] 4 VUs  0m33.8s/2m0s

running (0m34.1s), 4/4 VUs, 46 complete and 0 interrupted iterations
mixed   [  29% ] 4 VUs  0m34.8s/2m0s

running (0m35.1s), 4/4 VUs, 46 complete and 0 interrupted iterations
mixed   [  30% ] 4 VUs  0m35.8s/2m0s

running (0m36.1s), 4/4 VUs, 47 complete and 0 interrupted iterations
mixed   [  31% ] 4 VUs  0m36.8s/2m0s

running (0m37.1s), 4/4 VUs, 50 complete and 0 interrupted iterations
mixed   [  31% ] 4 VUs  0m37.8s/2m0s

running (0m38.1s), 4/4 VUs, 51 complete and 0 interrupted iterations
mixed   [  32% ] 4 VUs  0m38.8s/2m0s

running (0m39.1s), 4/4 VUs, 51 complete and 0 interrupted iterations
mixed   [  33% ] 4 VUs  0m39.8s/2m0s

running (0m40.1s), 4/4 VUs, 51 complete and 0 interrupted iterations
mixed   [  34% ] 4 VUs  0m40.8s/2m0s

running (0m41.1s), 4/4 VUs, 53 complete and 0 interrupted iterations
mixed   [  35% ] 4 VUs  0m41.8s/2m0s

running (0m42.1s), 4/4 VUs, 55 complete and 0 interrupted iterations
mixed   [  36% ] 4 VUs  0m42.8s/2m0s

running (0m43.1s), 4/4 VUs, 57 complete and 0 interrupted iterations
mixed   [  36% ] 4 VUs  0m43.8s/2m0s

running (0m44.1s), 4/4 VUs, 58 complete and 0 interrupted iterations
mixed   [  37% ] 4 VUs  0m44.8s/2m0s

running (0m45.1s), 4/4 VUs, 59 complete and 0 interrupted iterations
mixed   [  38% ] 4 VUs  0m45.8s/2m0s

running (0m46.1s), 4/4 VUs, 61 complete and 0 interrupted iterations
mixed   [  39% ] 4 VUs  0m46.8s/2m0s

running (0m47.1s), 4/4 VUs, 62 complete and 0 interrupted iterations
mixed   [  40% ] 4 VUs  0m47.8s/2m0s

running (0m48.1s), 4/4 VUs, 64 complete and 0 interrupted iterations
mixed   [  41% ] 4 VUs  0m48.8s/2m0s

running (0m49.1s), 4/4 VUs, 66 complete and 0 interrupted iterations
mixed   [  41% ] 4 VUs  0m49.8s/2m0s

running (0m49.2s), 4/4 VUs, 66 complete and 0 interrupted iterations
mixed   [  42% ] 4 VUs  0m50.8s/2m0s

running (0m50.2s), 4/4 VUs, 67 complete and 0 interrupted iterations
mixed   [  43% ] 4 VUs  0m51.8s/2m0s

running (0m51.2s), 4/4 VUs, 68 complete and 0 interrupted iterations
mixed   [  44% ] 4 VUs  0m52.8s/2m0s

running (0m52.2s), 4/4 VUs, 70 complete and 0 interrupted iterations
mixed   [  45% ] 4 VUs  0m53.8s/2m0s

running (0m53.2s), 4/4 VUs, 72 complete and 0 interrupted iterations
mixed   [  46% ] 4 VUs  0m54.8s/2m0s

running (0m54.2s), 4/4 VUs, 73 complete and 0 interrupted iterations
mixed   [  46% ] 4 VUs  0m55.8s/2m0s

running (0m55.2s), 4/4 VUs, 74 complete and 0 interrupted iterations
mixed   [  47% ] 4 VUs  0m56.8s/2m0s

running (0m56.2s), 4/4 VUs, 76 complete and 0 interrupted iterations
mixed   [  48% ] 4 VUs  0m57.8s/2m0s

running (0m57.2s), 4/4 VUs, 77 complete and 0 interrupted iterations
mixed   [  49% ] 4 VUs  0m58.8s/2m0s

running (0m58.2s), 4/4 VUs, 78 complete and 0 interrupted iterations
mixed   [  50% ] 4 VUs  0m59.8s/2m0s

running (0m59.2s), 4/4 VUs, 79 complete and 0 interrupted iterations
mixed   [  51% ] 4 VUs  1m00.8s/2m0s

running (1m00.2s), 4/4 VUs, 81 complete and 0 interrupted iterations
mixed   [  51% ] 4 VUs  1m01.8s/2m0s

running (1m01.2s), 4/4 VUs, 83 complete and 0 interrupted iterations
mixed   [  52% ] 4 VUs  1m02.8s/2m0s

running (1m02.2s), 4/4 VUs, 85 complete and 0 interrupted iterations
mixed   [  53% ] 4 VUs  1m03.8s/2m0s

running (1m03.2s), 4/4 VUs, 87 complete and 0 interrupted iterations
mixed   [  54% ] 4 VUs  1m04.8s/2m0s

running (1m04.2s), 4/4 VUs, 88 complete and 0 interrupted iterations
mixed   [  55% ] 4 VUs  1m05.8s/2m0s

running (1m05.2s), 4/4 VUs, 88 complete and 0 interrupted iterations
mixed   [  56% ] 4 VUs  1m06.8s/2m0s

running (1m06.2s), 4/4 VUs, 88 complete and 0 interrupted iterations
mixed   [  56% ] 4 VUs  1m07.8s/2m0s

running (1m07.2s), 4/4 VUs, 91 complete and 0 interrupted iterations
mixed   [  57% ] 4 VUs  1m08.8s/2m0s

running (1m08.2s), 4/4 VUs, 92 complete and 0 interrupted iterations
mixed   [  58% ] 4 VUs  1m09.8s/2m0s

running (1m09.2s), 4/4 VUs, 93 complete and 0 interrupted iterations
mixed   [  59% ] 4 VUs  1m10.8s/2m0s

running (1m10.2s), 4/4 VUs, 93 complete and 0 interrupted iterations
mixed   [  60% ] 4 VUs  1m11.8s/2m0s

running (1m11.2s), 4/4 VUs, 95 complete and 0 interrupted iterations
mixed   [  61% ] 4 VUs  1m12.8s/2m0s

running (1m12.2s), 4/4 VUs, 97 complete and 0 interrupted iterations
mixed   [  61% ] 4 VUs  1m13.8s/2m0s

running (1m13.2s), 4/4 VUs, 97 complete and 0 interrupted iterations
mixed   [  62% ] 4 VUs  1m14.8s/2m0s

running (1m14.2s), 4/4 VUs, 97 complete and 0 interrupted iterations
mixed   [  63% ] 4 VUs  1m15.8s/2m0s

running (1m15.2s), 4/4 VUs, 100 complete and 0 interrupted iterations
mixed   [  64% ] 4 VUs  1m16.8s/2m0s

running (1m16.2s), 4/4 VUs, 101 complete and 0 interrupted iterations
mixed   [  65% ] 4 VUs  1m17.8s/2m0s

running (1m17.2s), 4/4 VUs, 103 complete and 0 interrupted iterations
mixed   [  66% ] 4 VUs  1m18.8s/2m0s

running (1m18.2s), 4/4 VUs, 104 complete and 0 interrupted iterations
mixed   [  66% ] 4 VUs  1m19.8s/2m0s

running (1m18.2s), 4/4 VUs, 105 complete and 0 interrupted iterations
mixed   [  67% ] 4 VUs  1m20.8s/2m0s

running (1m19.2s), 4/4 VUs, 106 complete and 0 interrupted iterations
mixed   [  68% ] 4 VUs  1m21.8s/2m0s

running (1m20.2s), 4/4 VUs, 109 complete and 0 interrupted iterations
mixed   [  69% ] 4 VUs  1m22.8s/2m0s

running (1m21.2s), 4/4 VUs, 109 complete and 0 interrupted iterations
mixed   [  70% ] 4 VUs  1m23.8s/2m0s

running (1m22.2s), 4/4 VUs, 109 complete and 0 interrupted iterations
mixed   [  71% ] 4 VUs  1m24.8s/2m0s

running (1m23.2s), 4/4 VUs, 112 complete and 0 interrupted iterations
mixed   [  71% ] 4 VUs  1m25.8s/2m0s

running (1m24.2s), 4/4 VUs, 115 complete and 0 interrupted iterations
mixed   [  72% ] 4 VUs  1m26.8s/2m0s

running (1m25.2s), 4/4 VUs, 115 complete and 0 interrupted iterations
mixed   [  73% ] 4 VUs  1m27.8s/2m0s

running (1m26.2s), 4/4 VUs, 115 complete and 0 interrupted iterations
mixed   [  74% ] 4 VUs  1m28.8s/2m0s

running (1m27.2s), 4/4 VUs, 117 complete and 0 interrupted iterations
mixed   [  75% ] 4 VUs  1m29.8s/2m0s

running (1m28.2s), 4/4 VUs, 118 complete and 0 interrupted iterations
mixed   [  76% ] 4 VUs  1m30.8s/2m0s

running (1m29.2s), 4/4 VUs, 121 complete and 0 interrupted iterations
mixed   [  76% ] 4 VUs  1m31.8s/2m0s

running (1m30.2s), 4/4 VUs, 122 complete and 0 interrupted iterations
mixed   [  77% ] 4 VUs  1m32.8s/2m0s

running (1m31.2s), 4/4 VUs, 123 complete and 0 interrupted iterations
mixed   [  78% ] 4 VUs  1m33.8s/2m0s

running (1m32.2s), 4/4 VUs, 123 complete and 0 interrupted iterations
mixed   [  79% ] 4 VUs  1m34.8s/2m0s

running (1m33.2s), 4/4 VUs, 124 complete and 0 interrupted iterations
mixed   [  80% ] 4 VUs  1m35.8s/2m0s

running (1m34.2s), 4/4 VUs, 127 complete and 0 interrupted iterations
mixed   [  81% ] 4 VUs  1m36.8s/2m0s

running (1m35.2s), 4/4 VUs, 127 complete and 0 interrupted iterations
mixed   [  81% ] 4 VUs  1m37.8s/2m0s

running (1m36.2s), 4/4 VUs, 128 complete and 0 interrupted iterations
mixed   [  82% ] 4 VUs  1m38.8s/2m0s

running (1m37.2s), 4/4 VUs, 129 complete and 0 interrupted iterations
mixed   [  83% ] 4 VUs  1m39.8s/2m0s

running (1m38.2s), 4/4 VUs, 131 complete and 0 interrupted iterations
mixed   [  84% ] 4 VUs  1m40.8s/2m0s

running (1m39.2s), 4/4 VUs, 131 complete and 0 interrupted iterations
mixed   [  85% ] 4 VUs  1m41.8s/2m0s

running (1m40.2s), 4/4 VUs, 132 complete and 0 interrupted iterations
mixed   [  86% ] 4 VUs  1m42.8s/2m0s

running (1m41.2s), 4/4 VUs, 136 complete and 0 interrupted iterations
mixed   [  86% ] 4 VUs  1m43.8s/2m0s

running (1m42.2s), 4/4 VUs, 136 complete and 0 interrupted iterations
mixed   [  87% ] 4 VUs  1m44.8s/2m0s

running (1m43.2s), 4/4 VUs, 138 complete and 0 interrupted iterations
mixed   [  88% ] 4 VUs  1m45.8s/2m0s

running (1m44.2s), 4/4 VUs, 138 complete and 0 interrupted iterations
mixed   [  89% ] 4 VUs  1m46.8s/2m0s

running (1m45.2s), 4/4 VUs, 141 complete and 0 interrupted iterations
mixed   [  90% ] 4 VUs  1m47.8s/2m0s

running (1m46.2s), 4/4 VUs, 141 complete and 0 interrupted iterations
mixed   [  91% ] 4 VUs  1m48.8s/2m0s

running (1m47.2s), 4/4 VUs, 144 complete and 0 interrupted iterations
mixed   [  91% ] 4 VUs  1m49.8s/2m0s

running (1m47.3s), 4/4 VUs, 144 complete and 0 interrupted iterations
mixed   [  92% ] 4 VUs  1m50.8s/2m0s

running (1m48.3s), 4/4 VUs, 147 complete and 0 interrupted iterations
mixed   [  93% ] 4 VUs  1m51.8s/2m0s

running (1m49.3s), 4/4 VUs, 149 complete and 0 interrupted iterations
mixed   [  94% ] 4 VUs  1m52.8s/2m0s

running (1m50.3s), 4/4 VUs, 151 complete and 0 interrupted iterations
mixed   [  95% ] 4 VUs  1m53.8s/2m0s

running (1m51.3s), 4/4 VUs, 152 complete and 0 interrupted iterations
mixed   [  96% ] 4 VUs  1m54.8s/2m0s

running (1m52.3s), 4/4 VUs, 154 complete and 0 interrupted iterations
mixed   [  96% ] 4 VUs  1m55.8s/2m0s

running (1m53.3s), 4/4 VUs, 156 complete and 0 interrupted iterations
mixed   [  97% ] 4 VUs  1m56.8s/2m0s

running (1m54.3s), 4/4 VUs, 156 complete and 0 interrupted iterations
mixed   [  98% ] 4 VUs  1m57.8s/2m0s

running (1m55.3s), 4/4 VUs, 159 complete and 0 interrupted iterations
mixed   [  99% ] 4 VUs  1m58.8s/2m0s

running (1m56.3s), 4/4 VUs, 161 complete and 0 interrupted iterations
mixed   [ 100% ] 4 VUs  1m59.8s/2m0s

running (1m57.3s), 3/4 VUs, 162 complete and 0 interrupted iterations
mixed ↓ [ 100% ] 4 VUs  2m0s

running (1m58.3s), 2/4 VUs, 163 complete and 0 interrupted iterations
mixed ↓ [ 100% ] 4 VUs  2m0s

running (1m59.3s), 2/4 VUs, 163 complete and 0 interrupted iterations
mixed ↓ [ 100% ] 4 VUs  2m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=163.3ms
    ✓ 'p(99)<1500' p(99)=167.45ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2272    18.930992/s
    checks_succeeded...: 100.00% 2272 out of 2272
    checks_failed......: 0.00%   0 out of 2272

    ✓ 로그인 envelope success=true
    ✓ 로그인 token 존재
    ✓ 2xx 응답
    ✓ ApiResponse success=true

    HTTP
    http_req_duration..............: avg=12.64ms min=118.81µs med=3.84ms max=174.33ms p(90)=7.36ms p(95)=163.3ms
      { expected_response:true }...: avg=12.64ms min=118.81µs med=3.84ms max=174.33ms p(90)=7.36ms p(95)=163.3ms
    http_req_failed................: 0.00%  0 out of 1136
    http_reqs......................: 1136   9.465496/s

    EXECUTION
    iteration_duration.............: avg=2.96s   min=1.1s     med=2.89s  max=5.19s    p(90)=4.51s  p(95)=4.68s  
    iterations.....................: 165    1.37483/s
    vus............................: 2      min=2         max=4
    vus_max........................: 4      min=4         max=4

    NETWORK
    data_received..................: 2.3 MB 19 kB/s
    data_sent......................: 477 kB 4.0 kB/s



running (2m00.0s), 0/4 VUs, 165 complete and 0 interrupted iterations
mixed ✓ [ 100% ] 4 VUs  2m0s